import Vue from "vue";
import Vuex from 'vuex'

Vue.use(Vuex);

export const store = new Vuex.Store({
    state:{
        user: {
            id: 0,
            name: '',
            email: '',
            admin: false,
            subscription: {
                start: 0 ,
                end: 0,
            },
            loged: false,
            token: ''
        },
        sections:{
            navbar: {
                logo: {
                    text: '',
                    img: ''
                },
                color: {
                    bg: '',
                    bf: '',
                    font: '',
                    active: ''
                }
            }
        },
        
        currentPage: 'dashboard',
        // Start Admin Panel
        AdminPanel: {
            userEdit: {
                name: '',
                email: '',
                password: '',
                date_start: '',
                date_end: '',
            }
        },
        // Start Articles
        articles:[
            {
                id: 1,
                img: 'https://imgplaceholder.com/420x320',
				title: ' نموذج لوريم ايبسوم عربي',
				body: '<p><p><b>لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور</b></p><p><b>أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد</b></p><p><b>أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس</b></p><p><b><i>أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت</i></b></p><p><b>نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا</b></p><p><b>كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."</b></p><b></b><p><ul><li>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</li><li><p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد<br></li><li><p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</p><br><br></li></ul></p><br><br></p>',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 2,
                img: 'https://imgplaceholder.com/420x320',
				title: 'نموذج لوريم ايبسوم عربي',
				body: '<h1 style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ٣٠, ونتج والحزب المذابح كل جوي. أسر كارثة المشتّتون بل, وبعض وبداية الصفحة غزو قد, أي بحث تعداد الجنوب.</h1><ol><li style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">قصف المسرح واستمر الإتحاد في, ذات أسيا للغزو، الخطّة و, الآخر لألمانيا جهة بل. في سحقت هيروشيما البريطاني يتم, غريمه باحتلال الأيديولوجية، في فصل, دحر وقرى لهيمنة الإيطالية ٣٠. استبدال استسلام القاذفات عل مما. ببعض مئات وبلجيكا، قد أما, قِبل الدنمارك حتى كل, العمليات اليابانية انه أن.</li></ol><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;"><u>حتى هاربر موسكو ثم, وتقهقر المنتصرة حدة عل, التي فهرست واشتدّت أن أسر. كانت المتاخمة التغييرات أم وفي. ان وانتهاءً باستحداث قهر. ان ضمنها للأراضي الأوروبية ذات.</u></p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;"><b>حشد الثقيل المنتصر ثم, أسر قررت تم. وغير تصفح الحزب واستمر, مشروط الساحلية هذا ان. أما معركة لبلجيكا، من, الألوف الثقيلة الإنجليزية أسر ٣٠. ٣٠ دار أمام أحدث, أما بحشد الهادي الدولارات ما, هو الحزب الصفحة محاولات قبل. وبحلول الخنادق الأوروبية، ان غير, وليرتفع برلين، انه, انتباه الوزراء البولندي تم تلك.</b></p><p dir="rtl" style="text-align: right; margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">كما أن وقام وبدأت, لم أدوات للمجهود بلا. إذ لها الأول الستار, تحت وصغار مدينة عل. أي بحشد ليرتفع الساحلية أما, ليركز الهادي للأسطول ما هذا, أسابيع الروسية وتم عن. وفي مع شدّت فكان أدوات. سمّي تعداد ونستون هذا ما. به، بـ الخاصّة هيروشيما, وربع جندي الشهير الساحل.</p><p dir="rtl" style="text-align: right; margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">يكن لعدم الثانية عل, جديداً الخاطفة منشوريا بها تم, إذ جهة الأمم الجنوب. أي أما الحربية المعارك, قد وعلى الحربي، الأولية جعل. بحث إعادة قُدُماً ان, بحث أطراف استولت شموليةً ما. الغزو قبضتهم للسيطرة عدد أم. دون أي بالقصف العالم، للأسطول.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">مدن ثم للسيطرة سنغافورة, أفاق الاعتداء أخر ٣٠, لمّ أسيا غرّة، مع. هو ودول وجهان فقد, في الوراء وبالتحديد، غير. وألمّ وجهان به،, ان ربع حصدت وحزبه, أم جعل بشكل سابق الكونجرس. وضم يقوم الأولية شموليةً أن, أي ربع طرفاً الأرضية.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">ذلك بالفشل ونستون ابتدعها قد. لها قد مساعدة الحلفاء, واشتدّت الهزائم إلى كل. تم البلطيق الحيلولة دار, عن به، تُصب البرية والحلفاء. مشارف واشتدّت شبح كل, بتخصيص بل مما. الحرة بقيادة تم وصل.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">لغزو احتار كل أسر, بـ هُزم النمسا الخاسر بعد, من مسرح ألمانيا البشريةً فعل. والجنوب ارتكبها وبالتحديد، فعل. الا مع قِبل أمدها جديداً. بوابة الضغوط أن ولم. قد لمّ مكثّفة دنكيرك. جهة وبعض شعار ان.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">بحق نهاية تكاليف بريطانيا، ما, إلى أن النزاع الألماني. حرب غزوه أصقاع القوقازية تم, حتى كل ألماني بقيادة والكوري, بلا أجزاء مواقعها بل. عدد عقبت بالسيطرة عل. دول معقل لهذه أسابيع. أن وقد وباءت المجتمع, هجوم وبغطاء ذلك هو. تعديل فهرست."</p>',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 3,
                img: 'https://imgplaceholder.com/420x320',
				title: 'This is headerd',
				body: 'This is body This is body This is body This is body This is body',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 4,
                img: 'https://imgplaceholder.com/420x320',
				title: 'This is headerd',
				body: 'This is body This is body This is body This is body This is body',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 5,
                img: 'https://imgplaceholder.com/420x320',
				title: ' نموذج لوريم ايبسوم عربي',
				body: '<p><p><b>لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور</b></p><p><b>أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد</b></p><p><b>أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس</b></p><p><b><i>أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت</i></b></p><p><b>نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا</b></p><p><b>كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."</b></p><b></b><p><ul><li>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</li><li><p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد<br></li><li><p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</p><br><br></li></ul></p><br><br></p>',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 6,
                img: 'https://imgplaceholder.com/420x320',
				title: 'نموذج لوريم ايبسوم عربي',
				body: '<h1 style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ٣٠, ونتج والحزب المذابح كل جوي. أسر كارثة المشتّتون بل, وبعض وبداية الصفحة غزو قد, أي بحث تعداد الجنوب.</h1><ol><li style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">قصف المسرح واستمر الإتحاد في, ذات أسيا للغزو، الخطّة و, الآخر لألمانيا جهة بل. في سحقت هيروشيما البريطاني يتم, غريمه باحتلال الأيديولوجية، في فصل, دحر وقرى لهيمنة الإيطالية ٣٠. استبدال استسلام القاذفات عل مما. ببعض مئات وبلجيكا، قد أما, قِبل الدنمارك حتى كل, العمليات اليابانية انه أن.</li></ol><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;"><u>حتى هاربر موسكو ثم, وتقهقر المنتصرة حدة عل, التي فهرست واشتدّت أن أسر. كانت المتاخمة التغييرات أم وفي. ان وانتهاءً باستحداث قهر. ان ضمنها للأراضي الأوروبية ذات.</u></p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;"><b>حشد الثقيل المنتصر ثم, أسر قررت تم. وغير تصفح الحزب واستمر, مشروط الساحلية هذا ان. أما معركة لبلجيكا، من, الألوف الثقيلة الإنجليزية أسر ٣٠. ٣٠ دار أمام أحدث, أما بحشد الهادي الدولارات ما, هو الحزب الصفحة محاولات قبل. وبحلول الخنادق الأوروبية، ان غير, وليرتفع برلين، انه, انتباه الوزراء البولندي تم تلك.</b></p><p dir="rtl" style="text-align: right; margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">كما أن وقام وبدأت, لم أدوات للمجهود بلا. إذ لها الأول الستار, تحت وصغار مدينة عل. أي بحشد ليرتفع الساحلية أما, ليركز الهادي للأسطول ما هذا, أسابيع الروسية وتم عن. وفي مع شدّت فكان أدوات. سمّي تعداد ونستون هذا ما. به، بـ الخاصّة هيروشيما, وربع جندي الشهير الساحل.</p><p dir="rtl" style="text-align: right; margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">يكن لعدم الثانية عل, جديداً الخاطفة منشوريا بها تم, إذ جهة الأمم الجنوب. أي أما الحربية المعارك, قد وعلى الحربي، الأولية جعل. بحث إعادة قُدُماً ان, بحث أطراف استولت شموليةً ما. الغزو قبضتهم للسيطرة عدد أم. دون أي بالقصف العالم، للأسطول.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">مدن ثم للسيطرة سنغافورة, أفاق الاعتداء أخر ٣٠, لمّ أسيا غرّة، مع. هو ودول وجهان فقد, في الوراء وبالتحديد، غير. وألمّ وجهان به،, ان ربع حصدت وحزبه, أم جعل بشكل سابق الكونجرس. وضم يقوم الأولية شموليةً أن, أي ربع طرفاً الأرضية.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">ذلك بالفشل ونستون ابتدعها قد. لها قد مساعدة الحلفاء, واشتدّت الهزائم إلى كل. تم البلطيق الحيلولة دار, عن به، تُصب البرية والحلفاء. مشارف واشتدّت شبح كل, بتخصيص بل مما. الحرة بقيادة تم وصل.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">لغزو احتار كل أسر, بـ هُزم النمسا الخاسر بعد, من مسرح ألمانيا البشريةً فعل. والجنوب ارتكبها وبالتحديد، فعل. الا مع قِبل أمدها جديداً. بوابة الضغوط أن ولم. قد لمّ مكثّفة دنكيرك. جهة وبعض شعار ان.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">بحق نهاية تكاليف بريطانيا، ما, إلى أن النزاع الألماني. حرب غزوه أصقاع القوقازية تم, حتى كل ألماني بقيادة والكوري, بلا أجزاء مواقعها بل. عدد عقبت بالسيطرة عل. دول معقل لهذه أسابيع. أن وقد وباءت المجتمع, هجوم وبغطاء ذلك هو. تعديل فهرست."</p>',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 7,
                img: 'https://imgplaceholder.com/420x320',
				title: 'This is headerd',
				body: 'This is body This is body This is body This is body This is body',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 8,
                img: 'https://imgplaceholder.com/420x320',
				title: 'This is headerd',
				body: 'This is body This is body This is body This is body This is body',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 9,
                img: 'https://imgplaceholder.com/420x320',
				title: ' نموذج لوريم ايبسوم عربي',
				body: '<p><p><b>لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور</b></p><p><b>أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت انيم أد مينيم فينايم,كيواس نوستريد</b></p><p><b>أكسير سيتاشن يللأمكو لابورأس نيسي يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس</b></p><p><b><i>أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت</i></b></p><p><b>نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت ,سيونت ان كيولبا</b></p><p><b>كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم."</b></p><b></b><p><ul><li>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</li><li><p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد<br></li><li><p>ايست,كيواي دولوريم ايبسيوم كيوا دولار سايت أميت, كونسيكتيتيور,أديبايسكاي فيلايت, سيد</p><br><br></li></ul></p><br><br></p>',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 10,
                img: 'https://imgplaceholder.com/420x320',
				title: 'نموذج لوريم ايبسوم عربي',
				body: '<h1 style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ٣٠, ونتج والحزب المذابح كل جوي. أسر كارثة المشتّتون بل, وبعض وبداية الصفحة غزو قد, أي بحث تعداد الجنوب.</h1><ol><li style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">قصف المسرح واستمر الإتحاد في, ذات أسيا للغزو، الخطّة و, الآخر لألمانيا جهة بل. في سحقت هيروشيما البريطاني يتم, غريمه باحتلال الأيديولوجية، في فصل, دحر وقرى لهيمنة الإيطالية ٣٠. استبدال استسلام القاذفات عل مما. ببعض مئات وبلجيكا، قد أما, قِبل الدنمارك حتى كل, العمليات اليابانية انه أن.</li></ol><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;"><u>حتى هاربر موسكو ثم, وتقهقر المنتصرة حدة عل, التي فهرست واشتدّت أن أسر. كانت المتاخمة التغييرات أم وفي. ان وانتهاءً باستحداث قهر. ان ضمنها للأراضي الأوروبية ذات.</u></p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;"><b>حشد الثقيل المنتصر ثم, أسر قررت تم. وغير تصفح الحزب واستمر, مشروط الساحلية هذا ان. أما معركة لبلجيكا، من, الألوف الثقيلة الإنجليزية أسر ٣٠. ٣٠ دار أمام أحدث, أما بحشد الهادي الدولارات ما, هو الحزب الصفحة محاولات قبل. وبحلول الخنادق الأوروبية، ان غير, وليرتفع برلين، انه, انتباه الوزراء البولندي تم تلك.</b></p><p dir="rtl" style="text-align: right; margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">كما أن وقام وبدأت, لم أدوات للمجهود بلا. إذ لها الأول الستار, تحت وصغار مدينة عل. أي بحشد ليرتفع الساحلية أما, ليركز الهادي للأسطول ما هذا, أسابيع الروسية وتم عن. وفي مع شدّت فكان أدوات. سمّي تعداد ونستون هذا ما. به، بـ الخاصّة هيروشيما, وربع جندي الشهير الساحل.</p><p dir="rtl" style="text-align: right; margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">يكن لعدم الثانية عل, جديداً الخاطفة منشوريا بها تم, إذ جهة الأمم الجنوب. أي أما الحربية المعارك, قد وعلى الحربي، الأولية جعل. بحث إعادة قُدُماً ان, بحث أطراف استولت شموليةً ما. الغزو قبضتهم للسيطرة عدد أم. دون أي بالقصف العالم، للأسطول.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">مدن ثم للسيطرة سنغافورة, أفاق الاعتداء أخر ٣٠, لمّ أسيا غرّة، مع. هو ودول وجهان فقد, في الوراء وبالتحديد، غير. وألمّ وجهان به،, ان ربع حصدت وحزبه, أم جعل بشكل سابق الكونجرس. وضم يقوم الأولية شموليةً أن, أي ربع طرفاً الأرضية.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">ذلك بالفشل ونستون ابتدعها قد. لها قد مساعدة الحلفاء, واشتدّت الهزائم إلى كل. تم البلطيق الحيلولة دار, عن به، تُصب البرية والحلفاء. مشارف واشتدّت شبح كل, بتخصيص بل مما. الحرة بقيادة تم وصل.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">لغزو احتار كل أسر, بـ هُزم النمسا الخاسر بعد, من مسرح ألمانيا البشريةً فعل. والجنوب ارتكبها وبالتحديد، فعل. الا مع قِبل أمدها جديداً. بوابة الضغوط أن ولم. قد لمّ مكثّفة دنكيرك. جهة وبعض شعار ان.</p><p dir="rtl" style="margin-right: 0px; margin-bottom: 10px; margin-left: 0px; color: rgb(66, 66, 66); font-family: tahoma, sans-serif; font-size: 14px;">بحق نهاية تكاليف بريطانيا، ما, إلى أن النزاع الألماني. حرب غزوه أصقاع القوقازية تم, حتى كل ألماني بقيادة والكوري, بلا أجزاء مواقعها بل. عدد عقبت بالسيطرة عل. دول معقل لهذه أسابيع. أن وقد وباءت المجتمع, هجوم وبغطاء ذلك هو. تعديل فهرست."</p>',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 11,
                img: 'https://imgplaceholder.com/420x320',
				title: 'This is headerd',
				body: 'This is body This is body This is body This is body This is body',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            },
            {
                id: 12,
                img: 'https://imgplaceholder.com/420x320',
				title: 'This is headerd',
				body: 'This is body This is body This is body This is body This is body',
				info: 'وريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت ...',
            }
        ],
        // Start Tasks
        tasks: [
            
            {day: "Saturday", lists: ['Some thing98','Some thing15','Some thing1']},
            {day: "Sunday", lists: ['Some thing98','Some thing15','Some thing2']},
            {day: "Monday", lists: ['Some thing98','Some thing15','Some thing3']},
            {day: "Tuesday", lists: ['Some thing98','Some thing15','Some thing4']},
            {day: "Wednesday", lists: ['Some thing98','Some thing15','Some thing5']},
            {day: "Thursday", lists: ['Some thing98','Some thing15','Some thing6']},
     
        ]
    },
    mutations:{
        // Check if loged
        loged: state => {
            state.loged = !state.loged;
        },
        user(state, payload){
            Object.assign(state.user, payload)
        },
        change_current_page: (state, payload) => {
            state.currentPage = payload
         },
        Edit_Navbar: (state, payload) => {
            Object.assign(state.sections.navbar, payload)
        }
    },
    getters: {
        article: (state) => (id) => {
            return state.articles.filter(function(v){ return v["id"] == id })
        }
    }
});